ASC_CalculationAlgorithms/Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РеализацияТоваровУслуг</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АгентскиеУслуги</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ASC_CalculationAlgorithms/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДоговораУХ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентовУХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСтатьяДвиженияДенежныхСредств</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСтатьяИсполнение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойЦФО</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ASC_CalculationAlgorithms/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ASC_CalculationAlgorithms/WebServices/АСЦ_ВыгрузкаОФУ/Ext/Module.bsl
Функция ПолучитьДанныеДокументаРТУ(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Ссылка",            ДокументСсылка);
	Запрос.Параметры.Вставить("СвойствоСтраховая", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Страховая"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Дата КАК Дата,
	|	Док.Номер КАК Номер,
	|	Док.Организация КАК Организация,
	|	Док.Организация.ИНН КАК ОрганизацияИНН,
	|	Док.Организация.КПП КАК ОрганизацияКПП,
	|	Док.Контрагент КАК Контрагент,
	|	Док.Контрагент.Наименование КАК КонтрагентНаименование,
	|	Док.Контрагент.ИНН КАК КонтрагентИНН,
	|	Док.Контрагент.КПП КАК КонтрагентКПП,
	|	Док.Контрагент.ДокументУдостоверяющийЛичность КАК КонтрагентПаспорт,
	|	Док.ДоговорКонтрагента КАК Договор,
	|	Док.ДоговорКонтрагента.Наименование КАК ДоговорНаименование,
	|	Док.ДоговорКонтрагента.Дата КАК ДоговорДата,
	|	Док.ДоговорКонтрагента.ДатаНачала КАК ДоговорДатаНачала,
	|	Док.ДоговорКонтрагента.СрокДействия КАК ДоговорСрокДействия,
	|	Док.ДоговорКонтрагента.ОсновнойЦФО.Наименование КАК ЦФО,
	|	Док.СуммаДокумента КАК Сумма,
	|	ЕСТЬNULL(ДокАгентскиеУслуги.Номенклатура, ДокУслуги.Номенклатура) КАК Номенклатура,
	|	СпрНоменклатура.Наименование КАК НоменклатураНаименование,
	|	СпрНоменклатура.НоменклатурнаяГруппа.Наименование КАК НоменклатураНГ,
	|	Страховые.Ссылка КАК Страховая,
	|	ЕСТЬNULL(Страховые.ИНН, """") КАК СтраховаяИНН,
	|	ЕСТЬNULL(Страховые.КПП, """") КАК СтраховаяКПП,
	|	ЕСТЬNULL(Страховые.Наименование, """") КАК СтраховаяНаименование,
	|	ЕСТЬNULL(ДокАгентскиеУслуги.Сумма, 0) КАК СуммаАгенскиеУслуги,
	|	ЕСТЬNULL(ДокУслуги.Сумма, 0) КАК СуммаУслуги
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК ДокУслуги
	|		ПО (ДокУслуги.Ссылка = Док.Ссылка)
	|			И (ДокУслуги.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК ДокАгентскиеУслуги
	|		ПО (ДокАгентскиеУслуги.Ссылка = Док.Ссылка)
	|			И (ДокАгентскиеУслуги.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО (ЕСТЬNULL(ДокАгентскиеУслуги.Номенклатура, ДокУслуги.Номенклатура) = СпрНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыСтраховая
	|		ПО Док.ДоговорКонтрагента = ДоговорыСтраховая.Ссылка
	|			И (ДоговорыСтраховая.Свойство = &СвойствоСтраховая)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Страховые
	|		ПО (ДоговорыСтраховая.Значение = Страховые.Ссылка)
	|ГДЕ
	|	Док.Ссылка = &Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить()[0];
	
КонецФункции	

Функция Реализации(ДатаНач, ДатаКон, ОрганизацияГУИД)
	
	СписокРТУ = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.ascgroup.ru/OFU", "СписокРТУ"));
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Дата1",       ДатаНач);
	Запрос.Параметры.Вставить("Дата2",       ДатаКон);
	Запрос.Параметры.Вставить("Комментарий", "Прямые расчеты с СК");
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 20
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.Дата МЕЖДУ &Дата1 И &Дата2
	|	И НЕ Док.Комментарий ПОДОБНО &Комментарий
	|{ГДЕ
	|	Док.Организация}";
	
	Если ЗначениеЗаполнено(ОрганизацияГУИД) Тогда
		
		Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(ОрганизацияГУИД));
		
		ЭлементОтбора = Запрос.Отбор.Добавить("Организация");
		ЭлементОтбора.Установить(Организация, Истина);
		
	КонецЕсли;	
	
	Запрос.Выполнить();
	Выборка = Запрос.Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Данные = ПолучитьДанныеДокументаРТУ(Выборка.Ссылка);
		
		Документ = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.ascgroup.ru/OFU", "РТУ"));
		Документ.ГУИД  = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		Документ.Дата  = Данные.Дата;
		Документ.Номер = Данные.Номер;
		Документ.Тип   = "Реализация";
		
		// Организация
		пОрганизация = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.ascgroup.ru/OFU", "Организация"));
		пОрганизация.ГУИД = Строка(Данные.Организация.УникальныйИдентификатор());
		пОрганизация.ИНН  = Данные.ОрганизацияИНН;
		пОрганизация.КПП  = Данные.ОрганизацияКПП;
		
		Документ.Организация = пОрганизация;
		
		// Контрагент
		пКонтрагент = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.ascgroup.ru/OFU", "Контрагент"));
		пКонтрагент.ГУИД         = Строка(Данные.Контрагент.УникальныйИдентификатор());
		пКонтрагент.Наименование = Данные.КонтрагентНаименование;
		пКонтрагент.ИНН          = Данные.КонтрагентИНН;
		пКонтрагент.КПП          = Данные.КонтрагентКПП;
		пКонтрагент.Паспорт      = Данные.КонтрагентПаспорт;

		Документ.Контрагент = пКонтрагент;
		
		// Договор
		пДоговор = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.ascgroup.ru/OFU", "Договор"));
		пДоговор.ГУИД         = Строка(Данные.Договор.УникальныйИдентификатор());
		пДоговор.Наименование = Данные.ДоговорНаименование;
		пДоговор.Дата         = Данные.ДоговорДата;
		пДоговор.ДатаНачала   = Данные.ДоговорДатаНачала;
		пДоговор.СрокДействия = Данные.ДоговорСрокДействия;
		
		Документ.Договор = пДоговор;
		
		// Страховая
		пСтраховая = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.ascgroup.ru/OFU", "Контрагент"));
		пСтраховая.ГУИД         = ?(ЗначениеЗаполнено(Данные.Страховая), Строка(Данные.Страховая.УникальныйИдентификатор()), "");
		пСтраховая.Наименование = Данные.СтраховаяНаименование;
		пСтраховая.ИНН          = Данные.СтраховаяИНН;
		пСтраховая.КПП          = Данные.СтраховаяКПП;

		Документ.Страховая = пСтраховая;
		
		// Номенклатура
		пНоменклатура = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.ascgroup.ru/OFU", "Номенклатура"));
		пНоменклатура.Наименование         = Данные.НоменклатураНаименование;
		пНоменклатура.НоменклатурнаяГруппа = Данные.НоменклатураНГ;
		
		Документ.Номенклатура = пНоменклатура;
		
		Документ.ДЦ      = Данные.ЦФО;
		Документ.Сумма   = Данные.СуммаУслуги + Данные.СуммаАгенскиеУслуги;
		Документ.СуммаКВ = Данные.СуммаУслуги;
		
		СписокРТУ.Документы.Добавить(Документ);
		
	КонецЦикла;	
	
	Возврат СписокРТУ;
	
КонецФункции

Функция ОтчетПосредника()
	// Вставить содержимое обработчика.
КонецФункции
